#lower()  همه حروف را کوچک میکند
#upper()  همه حروف را بزرگ میکند
#capitalize()  حرف اول را بزرگ میکند
#title()  اول هر کلمه را بزرگ میکند
#swapcase()  کوچک ها را بزرگ و برعکس میکند
#strip()  فاصله های اول و اخر را حذف میکند
#ldtrip()  فاصله سمت چپ را حذف میکند
#rstrip()  فاصله سمت راست را حذف میکند
#replace(a,b)  جایگزینی متن
#find(x) محل اولین پیدا شدن
#index(x) مثل find ولی اگر پیدا نشود خطا میدهد
#count(x) تعداد تکرار
#split() رشته را به لیست تبدیل میکند میکند
#join() لیست را به رشته تبدیل میکند
#startswith() بررسی شروع شدن با یک مقدار
#endswith()  بررسی پایان یافتن با یک مقدار
#isalpha() فقط حروف است ؟
#isdigit() فقط عدد است ؟
#isalnum() فقط حروف و عدد است ؟
#islower() همه حروف کوچکند ؟
#isupper() همه حروف بزرگ اند ؟
#==============================================
#list[]
#append(x)  اضافه کردن به انتهای لیست
#insert(i,x) اضافه کردن در اندیس مشخص
#extend(lst) افزوزن عناصر یک لیست دیگر
#remove(x) حذف اولین عنصر مورد نظر
#pop(i) حذف اخرین عنصر
#clear() پاک کردن کل لیست
#copy() کپی گرفتن
#count(x) تعداد تکرار
#index(x) پیدا کردن اندیس
#sort() مرتب سازی
#reverse() برعکس کردن ترتیب
#============================================
#tuple()
#count(x) تعداد تکرار
#index(x) اندیس عنصر
#============================================
#set()
#add(x) افزودن عضو
#remove(x) حذف عضو
#discard(x) حذف بدون خطا
#pop() حذف یک عضو تصادفی
#clear() پاک کردن مجموعه
#union() اجتماع دو مجموعه
#intersection() اشتراک دو مجموعه
#difference() تفاضل
#issubset() زیر مجموعه بودن
#issuperset() ابر مجموعه بودن
#===========================================
#dictionary{}
#get(key) گرفتن مقدار کلید
#keys() نمایش کلیدها
#values() نمایش مقادیر
#items() نمایش کلید و مقدار
#update() بروزرسانی
#pop(key) حذف کلید
#popitem() حذف اخرین عضو
#setdefault() اگر کلید نبود ایجاد میکند
#clear() پاک کردن دیکشنری
#copy() کپی گرفتن
#==========================================
#file
#open() باز کردن فایل
#read() خواندن کل فاایل
#readline() خواندن یک خط
#readlines() خواندن همه خطوط
#write() نوشتن در فایل
#writelines() نوشتن چند خط
#close() بستن فایل
#seek() جابه جایی مکان نما
#tell() نمایش مکان فعلی مکان نما
#=========================================
#print() چاپ خروجی
#input() دریافت وروردی
#len() طول
#type() نوع متغیر
#int() تبدیل به عدد صحیح
#float() تبدیل به اعشاری
#str() تبدیل به رشته
#list() تبدیل به لیست
#tuple() تبدیل به توپل
#set() تبدیل به مجموعه
#dict() تبدیل به دیکشنری
#range() تولید بازه
#sum() جمع عناصر
#max() بزرگ ترین
#min() کوچک ترین
#sorted() مرتب سازی
#abs() قدرمطلق
#round() گرد کردن
#enumerate() شماره گزاری عناصر
#zip() ترکیب چند لیست
#map() اعمال تابع روی همه عناصر
#filter() فیلتر کردن عناصر
#any() حداقل یکی true است
#all() همه true هستنذ
#=======================================
#magic_methods
#__init__()
#__str__()
#__repr__()
#__len__()
#__add__()
#__sub__()
#__mul__()
#__eq__()
#__lt__()
#__gt__()
#__contains__()
#__iter__()
#__next__()
#=====================================
علیپور پارسا
جمعه 7:30